<?php
$array_1 = array('яблоко', 'апельсин', 'виноград');

print_r($array_1);
/* ->
Array
(
    [0] => яблоко
    [1] => апельсин
    [2] => виноград
)
*/

$array_2 = array();
$array_2[] = 'яблоко';
$array_2[] = 'апельсин';
$array_2[] = 'виноград';

print_r($array_2);
/* ->
Array
(
    [0] => яблоко
    [1] => апельсин
    [2] => виноград
)
*/
$array_3 = ['яблоко', 'апельсин', 'виноград'];
print_r($array_3);
/* ->
Array
(
    [0] => яблоко
    [1] => апельсин
    [2] => виноград
)
*/

// Индекс не с нуля
$numbers = [4=> 16, 25, 36, 49, 64];
print_r($numbers);
echo 'lenght: '.sizeof($numbers);
/* ->
Array
(
    [4] => 16
    [5] => 25
    [6] => 36
    [7] => 49
    [8] => 64
)
lenght: 5
*/
 ?>